Week 05/hw3.tex
% Created 2016-02-07 Sun 19:53
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{minted}
\usemintedstyle{tango}
\author{Ryan Sharif}
\date{\today}
\title{Breaking and fixing the Java Memory Model for profit}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.4.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents


\section{Answers and Summary}
\label{sec-1}
For the benefit of the T.A.s, I summarize my results and
findings for this homework before any of the material is
presented. This is because I have included an extensive
write up of the homework. Thus, this summary will attempt
to meet the requirements of the homework specification,
while the details for these findings are found in the
pages that follow.

The \verb~Synchronized~ and \verb~Null~ models provide a baseline
to begin our analysis. Looking at the results in the
following pages, we can see that the \verb~Null~ model runs
around two to three times faster than \verb~Synchronized~.
Thus, if our class implementations are done right, we
want to find ourselves somewhere in between these two
models. The Unsynchronized model, when it does not deadlock
should run at about the same speed as \verb~Null~; however,
I was never able to get it to complete the entire test
suite because of lockups. Hence, it results appear to
be significantly slower. But this is only because the
number of swaps is significantly smaller than the ones
we've done on the previous two models.

We avoid deadlocks and erronous ouput using the \verb~AtomicIntegerArray~
API that Java provides for us for our \verb~GetNSet~ model.  As the
specification indicates, it runs at a speed that is in between \verb~Null~
and \verb~Synchronized~. This is probably due to overhead that
\verb~Synchronized~ imposes on the execution of a method. Thus, this is a
desirable outcome for our company GDI. The implementation and
execution of \verb~BetterSafe~ is similarly faster than \verb~Synchronized~.
In fact, \verb~BetterSafe~ runs almost 2.5x faster than \verb~Synchronized~.
This model uses Java's Reentrant lock API. Since its overhead appears
to be much smaller than \verb~Synchronized~, it achieves faster over
run time. Still, with this speed up, it is able to maintain 
error-free results.

Finally, if our company GDI wants speed at the expense of a little
accuracy, the best model is \verb~BetterSorry~ as it achieves speeds
as fast as \verb~Null~, while sacrificing a little bit of accuracy.
I achieved this by creating a \verb~static volatile~ boolean that gets
flipped on and off when the program is executing critical portions
of code, i.e., writing to memory. It still contains race conditions
during reads, though these have been minimized to a maximum of two
instructions. A program that increases the liklihood of race conditions
is one that invokes a higher and higher number of threads.

\section{Introduction}
\label{sec-2}
\subsection{Checking environment variables and Java version}
\label{sec-2-1}
\subsubsection{Java version}
\label{sec-2-1-1}
Before we get started doing anything else in the assignment,
let's make sure that we have our environment variables and
an appropriate version of Java. I'll be using a local copy
of JDK version 1.8.071:

\begin{minted}[]{sh}
java -version
\end{minted}
Java(TM) SE Runtime Environment (build 1.8.0$_{\text{71}}$-b15)
Java HotSpot(TM) 64-Bit Server VM (build 25.71-b15, mixed mode)
\subsubsection{CPU information}
\label{sec-2-1-2}
We can look at our CPU information using \verb~less~ to see that we will
be using an Inter Core i3 Processor running at 3.3GHz. My particular
machine reports a single core. This may or may not affect the way
interleaved CPU instructions are executed on several cores. Thus,
I will run my code locally and on UCLA's SEASNET servers. 

\begin{minted}[]{sh}
less /proc/cpuinfo
\end{minted}
\subsubsection{Memory Information}
\label{sec-2-1-3}
We can similarly inspect our machine's memory information by look at
the `/proc/meminfo' file, which tells me that I have 764300 kB of
memory total.
\section{Running the tests}
\label{sec-3}
\subsection{Extracting jmm.jar}
\label{sec-3-1}
The files that we'll need for this assignment are compressed in 
the `jmm.jar' file. Thus, we'll need to decompress the jar file
before we can do anything else:

\begin{minted}[]{sh}
jar -xvf executables/jmm.jar
\end{minted}
created:   META-INF/              
inflated:  META-INF/MANIFEST.MF   
inflated:  NullState.java         
inflated:  State.java             
inflated:  SwapTest.java          
inflated:  SynchronizedState.java 
inflated:  UnsafeMemory.java      
\subsection{Makefile}
\label{sec-3-2}
Compiling the source files into executable class files will become tedious.
We can automate this process using a Makefile:

\begin{minted}[]{make}
JC = javac
OUTPUT = executables/

all: nullstate swaptest synchronized_state state unsafe_memory

# All classes for this assingnment
nullstate : NullState.java
	$(JC) -d $(OUTPUT) NullState.java
swaptest : SwapTest.java
	$(JC) -d $(OUTPUT) SwapTest.java
synchronized_state : SynchronizedState.java
	$(JC) -d $(OUTPUT) SynchronizedState.java
state: State.java
	$(JC) -d $(OUTPUT) State.java
unsafe_memory: UnsafeMemory.java
	$(JC) -d $(OUTPUT) UnsafeMemory.java

clean:
	rm $(OUTPUT)*
\end{minted}
\subsection{Testing}
\label{sec-3-3}
With the prerequisite files and environment variables all in order, we
can begin testing and working on the assignment. We'll begin our tests
on the Synchronized implementation, moving over to the Null model
afterwards.
