Week 05/hw3.tex
\subsubsection{Synchronized model}
\label{sec-3-3-1}
Here we test the synchronized model first. The initial results on my
local machine indicate that this program is not benefiting from more
threads. In fact, the more cores we add, the worse our program
performs. Given, these results, I will move over to the SEASNET
servers to test application peformance on a multicore machine.

\begin{verbatim}
Threads average 69.9444 ns/transition
Threads average 513.126 ns/transition
Threads average 1511.14 ns/transition
Threads average 3254.82 ns/transition
Threads average 6098.57 ns/transition
Threads average 12087.3 ns/transition
\end{verbatim}

Below are the tests and results from running the same
application on the SEASNET servers. The results from
the SEASNET servers run approximately twice as fast
as the results my local machine produced. 

\begin{verbatim}
Synchronized tests
first test set
01: Threads average 70.2679 ns/transition
02: Threads average 425.178 ns/transition
04: Threads average 1637.13 ns/transition
08: Threads average 2989.45 ns/transition
16: Threads average 5828.51 ns/transition
32: Threads average 14677.7 ns/transition
\end{verbatim}

\begin{verbatim}
second test set
01: Threads average 108.989 ns/transition
02: Threads average 740.129 ns/transition
04: Threads average 2763.78 ns/transition
08: Threads average 4828.20 ns/transition
16: Threads average 7848.66 ns/transition
32: Threads average 21089.5 ns/transition
\end{verbatim}

\begin{verbatim}
thirds test set
01: Threads average 90.7319 ns/transition
02: Threads average 530.770 ns/transition
04: Threads average 2188.73 ns/transition
08: Threads average 4002.67 ns/transition
16: Threads average 8794.03 ns/transition
32: Threads average 18009.1 ns/transition
\end{verbatim}


\subsubsection{Null model}
\label{sec-3-3-2}
As indicated by the specification for this assignment, the
Null model does not yet work but still passes the test,
thus it runs to completion much faster than the synchronized
model. We should note the overhead of creating threads
at least on this local machine adds considerable running
time to our program despite the fact that no actual work
is being done.

\begin{verbatim}
01 Threads average 36.7658 ns/transition
02 Threads average 132.399 ns/transition
04 Threads average 455.818 ns/transition
08 Threads average 2336.21 ns/transition
16 Threads average 4654.78 ns/transition
32 Threads average 8696.07 ns/transition
\end{verbatim}

\begin{minted}[]{sh}
cd files/executables;
echo "second test set";
echo -n "01: "; java UnsafeMemory Null 1 1000000 2 1 1 0 0 1
echo -n "02: "; java UnsafeMemory Null 2 1000000 2 1 1 0 0 1
echo -n "04: "; java UnsafeMemory Null 4 1000000 2 1 1 0 0 1
echo -n "08: "; java UnsafeMemory Null 8 1000000 2 1 1 0 0 1
echo -n "16: "; java UnsafeMemory Null 16 1000000 2 1 1 0 0 1
echo -n "32: "; java UnsafeMemory Null 32 1000000 2 1 1 0 0 1
\end{minted}


\begin{verbatim}
thirds test set
01: Threads average 36.5781 ns/transition
02: Threads average 138.304 ns/transition
04: Threads average 439.491 ns/transition
08: Threads average 2372.14 ns/transition
16: Threads average 4792.37 ns/transition
32: Threads average 8229.13 ns/transition
\end{verbatim}

\section{Unsynchronized implementation}
\label{sec-4}
We can begin implementing the unsynchronized model by bringing over
the code from the synchronized model and tinkering with it. We will
start with a basic class definition, naming the class
UnsynchronizedState and letting the Java compiler know that we'll be
implementing the class State. This means we'll have to take all the
method signatures from State and actually implement them here:

\begin{minted}[]{java}
class UnsynchronizedState implements State {
    private byte[] value;
    private byte maxval;
\end{minted}

Similar to the synchronized version, we'll have two constructors: a
constructor that receives an array to initialize to some value, and
sets the maximum value for the object to 127. We also have a second
constructor that similarly takes in an array but also takes in a
byte, setting the maximum value for this object to m.

\begin{minted}[]{java}
UnsynchronizedState(byte[] v) { value = v; maxval = 127; }

UnsynchronizedState(byte[] v, byte m) { value = v; maxval = m; }
\end{minted}

The key change to the class is simply a removal of the keyword
\verb~synchronized~ from the definition of the swap method:

\begin{minted}[]{java}
    public int size() { return value.length; }

    public byte[] current() { return value; }

    public boolean swap(int i, int j) {
	if (value[i] <= 0 || value[j] >= maxval) {
	    return false;
	}
	value[i]--;
	value[j]++;
	return true;
    }
}
\end{minted}

We can compile our class and test it like the other two we've
tested before:

\begin{minted}[]{sh}
cd files;
make unsynchronized_state
\end{minted}

Finally, before we can run our program again, we need to ensure that
our program knows how to use the new class by adding two lines of code:
\begin{minted}[]{java}
else if (args[0].equals("Unsynchronized"))
    s = new UnsynchronizedState(stateArg, maxval);
\end{minted}
