Week 05/hw3.org
** Running Unsynchronized
   There is a problem with the way that unsynchronized works. When we
   increase the number of threads or swaps beyond an arbitrary value
   the likelihood that the program will become deadlocked increases.
   Thus, for these tests we used orders of magnitude smaller swaps
   than previous tests:

  #+BEGIN_SRC sh :results output :exports results
    cd files/executables;
    echo -n "01 "; java UnsafeMemory Unsynchronized 1 1000 6 5 6 3 0 3
    echo -n "02 "; java UnsafeMemory Unsynchronized 2 1000 6 5 6 3 0 3
    echo -n "04 "; java UnsafeMemory Unsynchronized 4 1000 6 5 6 3 0 3
    echo -n "08 "; java UnsafeMemory Unsynchronized 8 1000 6 5 6 3 0 3
    echo -n "16 "; java UnsafeMemory Unsynchronized 16 1000 6 5 6 3 0 3
    echo -n "32 "; java UnsafeMemory Unsynchronized 32 1000 6 5 6 3 0 3
  #+END_SRC

  #+RESULTS:
   01 Threads average 3412.14 ns/transition
   02 Threads average 6278.02 ns/transition
   sum mismatch (17 != 12)
   04 Threads average 13747.9 ns/transition
   sum mismatch (17 != 18)
   08 Threads average 26983.3 ns/transition
   sum mismatch (17 != 19)
   16 Threads average 56221.0 ns/transition
   sum mismatch (17 != 16)
   32 Threads average 152139 ns/transition
   sum mismatch (17 != 16)

As expected, our unsynchronized class runs into race conditions, where we
get unexpected unreliable values.

* GetNSet
** Writing the Class
With the problematic /unsynchronized/ class implemented, we want
to achieve similar speed but without the race conditions. Is that
possible? Lets implement Java's atomic integer array and see if
we can do any better. A definition provided on Wikipedia states
that an atomic operation is one that is a guarantee of isolation
from concurrent processes. Since we'll be using the
AtomicIntegerArray class, lets include it in our file and
declare a variable ~valueIntegerArray~ that we'll instantiate
in our constructor:

#+BEGIN_SRC java :tangle files/GetNSet.java
  import java.util.concurrent.atomic.AtomicIntegerArray;

  class GetNSet implements State {
      private int[] value;
      private byte maxval;
      private AtomicIntegerArray valueIntegerArray;
#+END_SRC

With the variable declared above, we'd like to instantiate
an instance of the class; however, looking at the documentation
for AtomicIntegerArray shows us that we need to pass in an
integer array, not a byte array. Thus, we'll want to repurpose
~value~ as an ~int~ array and run a loop that will set each
element its equivalent in the byte array:

#+BEGIN_SRC java :tangle files/GetNSet.java
  GetNSet(byte[] v) {
      value = new int[v.length];

      for(int i = 0; i < value.length; i++){
          value[i] = v[i];
      }
      
      maxval = 127;
      valueIntegerArray = new AtomicIntegerArray(value);
  }

  GetNSet(byte[] v, byte m) { 
      value = new int[v.length];

      for(int i = 0; i < value.length; i++){
          value[i] = v[i];
      }
      
      maxval = m;
      valueIntegerArray = new AtomicIntegerArray(value);
  }
#+END_SRC

With the constructors that correctly instantiate our AtomIntegerArray
we can change the size method so that it gets the AtomicIntegerArray
length. We just call its ~length~ method. The ~current~ method requires
us to return a ~byte~ array, so we'll need to create a temporary
byte array and return it:

#+BEGIN_SRC java :tangle files/GetNSet.java
  public int size() { return valueIntegerArray.length(); }

  public byte[] current() {
      byte[] tmp = new byte[value.length];

      for(int i = 0; i < tmp.length; i++){
          tmp[i] = (byte) value[i];
      }
      
      return tmp;
  }
#+END_SRC

Finally, the ~swap~ function needs to use the ~get~ and ~set~ methods
provided by the AtomicIntegerArray class:

#+BEGIN_SRC java :tangle files/GetNSet.java
      public boolean swap(int i, int j) {
          if (valueIntegerArray.get(i) <= 0 || valueIntegerArray.get(j) >= maxval) {
              return false;
          }
          valueIntegerArray.getAndDecrement(i);
          valueIntegerArray.getAndIncrement(j);
          return true;
      }
  }
#+END_SRC
** Results
   Let's run this class, the same way we've done before:

   #+BEGIN_SRC sh :output results exports: results
     cd files/executables;
     echo -n "01 "; java UnsafeMemory GetNSet 1 1000000 6 5 6 3 0 3
     echo -n "02 "; java UnsafeMemory GetNSet 2 1000000 6 5 6 3 0 3
     echo -n "04 "; java UnsafeMemory GetNSet 4 1000000 6 5 6 3 0 3
     echo -n "08 "; java UnsafeMemory GetNSet 8 1000000 6 5 6 3 0 3
     echo -n "16 "; java UnsafeMemory GetNSet 16 1000000 6 5 6 3 0 3
     echo -n "32 "; java UnsafeMemory GetNSet 32 1000000 6 5 6 3 0 3
   #+END_SRC

   #+RESULTS:
   |  1 | Threads | average | 68.3925 | ns/transition |
   |  2 | Threads | average | 264.975 | ns/transition |
   |  4 | Threads | average | 752.434 | ns/transition |
   |  8 | Threads | average | 1603.59 | ns/transition |
   | 16 | Threads | average | 3138.84 | ns/transition |
   | 32 | Threads | average | 10880.7 | ns/transition |

   Like our previous results, we'd expect that the more threads we add
   the faster our program should run; however, it looks like the overhead
   of creating the threads is too costly for this simple swap function.
   On a positive note, we are no longer getting bad results, even testing
   on an array two and three orders of magnitude larger produces no
   bad results:

   #+BEGIN_SRC sh :output results :exports results
     cd files/executables;
     echo -n "32 "; java UnsafeMemory GetNSet 32 10000000 6 5 6 3 0 3
     echo -n "32 "; java UnsafeMemory GetNSet 32 100000000 6 5 6 3 0 3
   #+END_SRC

   #+RESULTS:
   | 32 | Threads | average | 3621.75 | ns/transition |
   | 32 | Threads | average | 3904.25 | ns/transition |

* BetterSafe
** Writing the class
We can now move to the BetterSafe model, which will
achieve better performance than /Synchronized/ but
still maintain 100% reliability. We will be able to
do this by implementing a system of locks and unlocks.

We begin with our familiar code from /Synchronized/,
maintaining a majority of the code. Thus, we only
change the name of the class along with the constructor
names to reflect this change. Finally, we'll add a
lock to use when we are performing a swap:

#+BEGIN_SRC java :tangle files/BetterSafe.java
  import java.util.concurrent.locks.ReentrantLock;

  class BetterSafe implements State {
      private byte[] value;
      private byte maxval;
      private final ReentrantLock swapLock;

      BetterSafe(byte[] v) {
          value = v; maxval = 127;
          swapLock = new ReentrantLock();
      }

      BetterSafe(byte[] v, byte m) {
          value = v; maxval = m;
          swapLock = new ReentrantLock();
      }
#+END_SRC

We'll remove the ~synchronized~ keyword from the swap
function and implement a use of locks to make sure that
no thread steps on anyone else's toes: 

#+BEGIN_SRC java :tangle files/BetterSafe.java

  public int size() { return value.length; }

  public byte[] current() { return value; }

  public boolean swap(int i, int j) {
      swapLock.lock();
      
      if (value[i] <= 0 || value[j] >= maxval) {
          swapLock.unlock();

          return false;
      }
      value[i]--;
      value[j]++;

      swapLock.unlock();
      
      return true;
                              }
  }
#+END_SRC
