Week 05/hw3.tex

\subsection{Running Unsynchronized}
\label{sec-4-1}
There is a problem with the way that unsynchronized works. When we
increase the number of threads or swaps beyond an arbitrary value
the likelihood that the program will become deadlocked increases.
Thus, for these tests we used orders of magnitude smaller swaps
than previous tests:

01 Threads average 3412.14 ns/transition
02 Threads average 6278.02 ns/transition
sum mismatch (17 != 12)
04 Threads average 13747.9 ns/transition
sum mismatch (17 != 18)
08 Threads average 26983.3 ns/transition
sum mismatch (17 != 19)
16 Threads average 56221.0 ns/transition
sum mismatch (17 != 16)
32 Threads average 152139 ns/transition
sum mismatch (17 != 16)

As expected, our unsynchronized class runs into race conditions, where we
get unexpected unreliable values.

\section{GetNSet}
\label{sec-5}
\subsection{Writing the Class}
\label{sec-5-1}
With the problematic \emph{unsynchronized} class implemented, we want
to achieve similar speed but without the race conditions. Is that
possible? Lets implement Java's atomic integer array and see if
we can do any better. A definition provided on Wikipedia states
that an atomic operation is one that is a guarantee of isolation
from concurrent processes. Since we'll be using the
AtomicIntegerArray class, lets include it in our file and
declare a variable \verb~valueIntegerArray~ that we'll instantiate
in our constructor:

\begin{minted}[]{java}
import java.util.concurrent.atomic.AtomicIntegerArray;

class GetNSet implements State {
    private int[] value;
    private byte maxval;
    private AtomicIntegerArray valueIntegerArray;
\end{minted}

With the variable declared above, we'd like to instantiate
an instance of the class; however, looking at the documentation
for AtomicIntegerArray shows us that we need to pass in an
integer array, not a byte array. Thus, we'll want to repurpose
\verb~value~ as an \verb~int~ array and run a loop that will set each
element its equivalent in the byte array:

\begin{minted}[]{java}
GetNSet(byte[] v) {
    value = new int[v.length];

    for(int i = 0; i < value.length; i++){
	value[i] = v[i];
    }

    maxval = 127;
    valueIntegerArray = new AtomicIntegerArray(value);
}

GetNSet(byte[] v, byte m) { 
    value = new int[v.length];

    for(int i = 0; i < value.length; i++){
	value[i] = v[i];
    }

    maxval = m;
    valueIntegerArray = new AtomicIntegerArray(value);
}
\end{minted}

With the constructors that correctly instantiate our AtomIntegerArray
we can change the size method so that it gets the AtomicIntegerArray
length. We just call its \verb~length~ method. The \verb~current~ method requires
us to return a \verb~byte~ array, so we'll need to create a temporary
byte array and return it:

\begin{minted}[]{java}
public int size() { return valueIntegerArray.length(); }

public byte[] current() {
    byte[] tmp = new byte[value.length];

    for(int i = 0; i < tmp.length; i++){
	tmp[i] = (byte) value[i];
    }

    return tmp;
}
\end{minted}

Finally, the \verb~swap~ function needs to use the \verb~get~ and \verb~set~ methods
provided by the AtomicIntegerArray class:

\begin{minted}[]{java}
    public boolean swap(int i, int j) {
	if (valueIntegerArray.get(i) <= 0 || valueIntegerArray.get(j) >= maxval) {
	    return false;
	}
	valueIntegerArray.getAndDecrement(i);
	valueIntegerArray.getAndIncrement(j);
	return true;
    }
}
\end{minted}
\subsection{Results}
\label{sec-5-2}
Let's run this class, the same way we've done before:

\begin{minted}[]{sh}
cd files/executables;
echo -n "01 "; java UnsafeMemory GetNSet 1 1000000 6 5 6 3 0 3
echo -n "02 "; java UnsafeMemory GetNSet 2 1000000 6 5 6 3 0 3
echo -n "04 "; java UnsafeMemory GetNSet 4 1000000 6 5 6 3 0 3
echo -n "08 "; java UnsafeMemory GetNSet 8 1000000 6 5 6 3 0 3
echo -n "16 "; java UnsafeMemory GetNSet 16 1000000 6 5 6 3 0 3
echo -n "32 "; java UnsafeMemory GetNSet 32 1000000 6 5 6 3 0 3
\end{minted}

Like our previous results, we'd expect that the more threads we add
the faster our program should run; however, it looks like the overhead
of creating the threads is too costly for this simple swap function.
On a positive note, we are no longer getting bad results, even testing
on an array two and three orders of magnitude larger produces no
bad results:

\begin{center}
\begin{tabular}{rllrl}
32 & Threads & average & 3621.75 & ns/transition\\
32 & Threads & average & 3904.25 & ns/transition\\
\end{tabular}
\end{center}

\section{BetterSafe}
\label{sec-6}
\subsection{Writing the class}
\label{sec-6-1}
We can now move to the BetterSafe model, which will
achieve better performance than \emph{Synchronized} but
still maintain 100\% reliability. We will be able to
do this by implementing a system of locks and unlocks.

We begin with our familiar code from \emph{Synchronized},
maintaining a majority of the code. Thus, we only
change the name of the class along with the constructor
names to reflect this change. Finally, we'll add a
lock to use when we are performing a swap:

\begin{minted}[]{java}
import java.util.concurrent.locks.ReentrantLock;

class BetterSafe implements State {
    private byte[] value;
    private byte maxval;
    private final ReentrantLock swapLock;

    BetterSafe(byte[] v) {
	value = v; maxval = 127;
	swapLock = new ReentrantLock();
    }

    BetterSafe(byte[] v, byte m) {
	value = v; maxval = m;
	swapLock = new ReentrantLock();
    }
\end{minted}

We'll remove the \verb~synchronized~ keyword from the swap
function and implement a use of locks to make sure that
no thread steps on anyone else's toes: 

\begin{minted}[]{java}
public int size() { return value.length; }

public byte[] current() { return value; }

public boolean swap(int i, int j) {
    swapLock.lock();

    if (value[i] <= 0 || value[j] >= maxval) {
	swapLock.unlock();

	return false;
    }
    value[i]--;
    value[j]++;

    swapLock.unlock();

    return true;
			    }
}
\end{minted}
