Week 05/hw3.org
** Testing BetterSafe
Let's test our BetterSafe class by performing the same tests
that we've done in the past:

#+BEGIN_SRC sh :output results :exports results
  cd files/executables;
  echo "orginal test:"
  echo -n "01 "; java UnsafeMemory BetterSafe 1 1000000 6 5 6 3 0 3
  echo -n "02 "; java UnsafeMemory BetterSafe 2 1000000 6 5 6 3 0 3
  echo -n "04 "; java UnsafeMemory BetterSafe 4 1000000 6 5 6 3 0 3
  echo -n "08 "; java UnsafeMemory BetterSafe 8 1000000 6 5 6 3 0 3
  echo -n "16 "; java UnsafeMemory BetterSafe 16 1000000 6 5 6 3 0 3
  echo -n "32 "; java UnsafeMemory BetterSafe 32 1000000 6 5 6 3 0 3

  echo "larger test:"
  echo -n "01 "; java UnsafeMemory BetterSafe 1 1000000 6 5 6 3 0 3
  echo -n "02 "; java UnsafeMemory BetterSafe 2 1000000 6 5 6 3 0 3
  echo -n "04 "; java UnsafeMemory BetterSafe 4 1000000 6 5 6 3 0 3
  echo -n "08 "; java UnsafeMemory BetterSafe 8 1000000 6 5 6 3 0 3
  echo -n "16 "; java UnsafeMemory BetterSafe 16 1000000 6 5 6 3 0 3
  echo -n "32 "; java UnsafeMemory BetterSafe 32 1000000 6 5 6 3 0 3
#+END_SRC

#+RESULTS:
| orginal | test:   |         |         |               |
|       1 | Threads | average | 78.0822 | ns/transition |
|       2 | Threads | average | 549.396 | ns/transition |
|       4 | Threads | average | 624.036 | ns/transition |
|       8 | Threads | average | 1160.22 | ns/transition |
|      16 | Threads | average | 2405.32 | ns/transition |
|      32 | Threads | average | 5874.64 | ns/transition |
|  larger | test:   |         |         |               |
|       1 | Threads | average | 78.6375 | ns/transition |
|       2 | Threads | average | 582.671 | ns/transition |
|       4 | Threads | average | 562.409 | ns/transition |
|       8 | Threads | average | 1207.74 | ns/transition |
|      16 | Threads | average | 2455.95 | ns/transition |
|      32 | Threads | average | 5522.98 | ns/transition |

* BetterSorry
** Writing BetterSorry
  #+BEGIN_SRC java :tangle files/BetterSorry.java
    import java.util.concurrent.TimeUnit;

    class BetterSorry implements State {
        private volatile byte[] value;
        private byte maxval;
        private static volatile boolean inCritical = false;
  #+END_SRC

  Similar to the synchronized version, we'll have two constructors: a
  constructor that receives an array to initialize to some value, and
  sets the maximum value for the object to 127. We also have a second
  constructor that similarly takes in an array but also takes in a
  byte, setting the maximum value for this object to m. We'll use a
  psuedo-lock by creating a boolean that lets us know when we're in
  a critical part of the execution, i.e., when we're writing to our
  array.

  #+BEGIN_SRC java :tangle files/BetterSorry.java
    BetterSorry(byte[] v) { value = v; maxval = 127; }

    BetterSorry(byte[] v, byte m) { value = v; maxval = m; }
  #+END_SRC

  To make sure we don't have any deadlocks, we'll check to make
  sure we are not in a critical section, i.e., writing to
  our array. If we are, we'll wait our turn. If not, then the
  thread will write what it needs to the array.

  #+BEGIN_SRC java :tangle files/BetterSorry.java
        public int size() { return value.length; }

        public byte[] current() { return value; }

        public boolean swap(int i, int j) {
            int v_i = value[i], v_j = value[j];

            if (v_i <= 0 || v_j >= maxval) {
                return false;
            }
            while(inCritical) {
                try {
                    TimeUnit.NANOSECONDS.sleep(1);
                } catch (InterruptedException e) {
                    // TODO Auto-generated catch block
                    e.printStackTrace();
                }
            }

            inCritical = true;
            
            value[i]--;
            value[j]++;

            inCritical = false;

            
            return true;
        }
    }
  #+END_SRC
** Testing BetterSorry

   #+BEGIN_SRC sh :output results :exports results
     cd files/executables;
     echo -n "01 "; java UnsafeMemory BetterSorry 1 1000000 6 5 6 3 0 3
     echo -n "02 "; java UnsafeMemory BetterSorry 2 1000000 6 5 6 3 0 3
     echo -n "04 "; java UnsafeMemory BetterSorry 4 1000000 6 5 6 3 0 3
     echo -n "08 "; java UnsafeMemory BetterSorry 8 1000000 6 5 6 3 0 3
     echo -n "16 "; java UnsafeMemory BetterSorry 16 1000000 6 5 6 3 0 3
     echo -n "32 "; java UnsafeMemory BetterSorry 32 1000000 6 5 6 3 0 3
   #+END_SRC

   #+RESULTS:
   |                      01 | Threads | average | 69.8024 | ns/transition |
   |                      02 | Threads | average | 141.296 | ns/transition |
   |                      04 | Threads | average | 295.705 | ns/transition |
   |                      08 | Threads | average | 644.861 | ns/transition |
   | sum mismatch (17 != 18) |         |         |         |               |
   |                      16 | Threads | average | 1722.14 | ns/transition |
   | sum mismatch (17 != 23) |         |         |         |               |
   |                      32 | Threads | average | 4318.05 | ns/transition |
   | sum mismatch (17 != 24) |         |         |         |               |
