Week 05/hw3.tex
\subsection{Testing BetterSafe}
\label{sec-6-2}
Let's test our BetterSafe class by performing the same tests
that we've done in the past:

\begin{center}
\begin{tabular}{rllrl}
orginal & test: &  &  & \\
1 & Threads & average & 78.0822 & ns/transition\\
2 & Threads & average & 549.396 & ns/transition\\
4 & Threads & average & 624.036 & ns/transition\\
8 & Threads & average & 1160.22 & ns/transition\\
16 & Threads & average & 2405.32 & ns/transition\\
32 & Threads & average & 5874.64 & ns/transition\\
larger & test: &  &  & \\
1 & Threads & average & 78.6375 & ns/transition\\
2 & Threads & average & 582.671 & ns/transition\\
4 & Threads & average & 562.409 & ns/transition\\
8 & Threads & average & 1207.74 & ns/transition\\
16 & Threads & average & 2455.95 & ns/transition\\
32 & Threads & average & 5522.98 & ns/transition\\
\end{tabular}
\end{center}

\section{BetterSorry}
\label{sec-7}
\subsection{Writing BetterSorry}
\label{sec-7-1}
\begin{minted}[]{java}
import java.util.concurrent.TimeUnit;

class BetterSorry implements State {
    private volatile byte[] value;
    private byte maxval;
    private static volatile boolean inCritical = false;
\end{minted}

Similar to the synchronized version, we'll have two constructors: a
constructor that receives an array to initialize to some value, and
sets the maximum value for the object to 127. We also have a second
constructor that similarly takes in an array but also takes in a
byte, setting the maximum value for this object to m. We'll use a
psuedo-lock by creating a boolean that lets us know when we're in
a critical part of the execution, i.e., when we're writing to our
array.

\begin{minted}[]{java}
BetterSorry(byte[] v) { value = v; maxval = 127; }

BetterSorry(byte[] v, byte m) { value = v; maxval = m; }
\end{minted}

To make sure we don't have any deadlocks, we'll check to make
sure we are not in a critical section, i.e., writing to
our array. If we are, we'll wait our turn. If not, then the
thread will write what it needs to the array.

\begin{minted}[]{java}
    public int size() { return value.length; }

    public byte[] current() { return value; }

    public boolean swap(int i, int j) {
	int v_i = value[i], v_j = value[j];

	if (v_i <= 0 || v_j >= maxval) {
	    return false;
	}
	while(inCritical) {
	    try {
		TimeUnit.NANOSECONDS.sleep(1);
	    } catch (InterruptedException e) {
		// TODO Auto-generated catch block
		e.printStackTrace();
	    }
	}

	inCritical = true;

	value[i]--;
	value[j]++;

	inCritical = false;


	return true;
    }
}
\end{minted}
\subsection{Testing BetterSorry}
\label{sec-7-2}

\begin{center}
\begin{tabular}{rllrl}
01 & Threads & average & 69.8024 & ns/transition\\
02 & Threads & average & 141.296 & ns/transition\\
04 & Threads & average & 295.705 & ns/transition\\
08 & Threads & average & 644.861 & ns/transition\\
sum mismatch (17 != 18) &  &  &  & \\
16 & Threads & average & 1722.14 & ns/transition\\
sum mismatch (17 != 23) &  &  &  & \\
32 & Threads & average & 4318.05 & ns/transition\\
sum mismatch (17 != 24) &  &  &  & \\
\end{tabular}
\end{center}
% Emacs 24.4.1 (Org mode 8.2.10)
\end{document}
